export interface Question {
    id: number;
    title: string;
    type?: "input" | "options" | "agenda";
    placeholder?: string;
    options?: string[];
    // เพิ่มบรรทัดนี้:
    [key: string]: any; 
}
export const questions = [
   {
        id: 1,
        title: "นัดประชุม ต้องประชุมเพราะอะไร",
        type: "options", // เพิ่มตรงนี้!
        options: ["ประชุมสามัญ (AGM)", "ประชุมวิสามัญ (EGM)"]
    },
    {
        id: 2,
        title: "ใครเป็นคนเรียกประชุม",
        type: "input",
        placeholder: "เขียนชื่อ-นามสกุล"
    },
   {
        id: 3,
        title: "กำหนดวาระการประชุม",
        type: "agenda",
        regularAgendas: [
            "รับรองรายงานการประชุมครั้งก่อน", "รับรองงบการเงิน", "อนุมัติจ่ายเงินปันผล",
            "แต่งตั้งผู้สอบบัญชี", "กำหนดค่าตอบแทนผู้สอบบัญชี", "เลือกตั้งกรรมการบริษัท",
            "ถอดถอนกรรมการ", "อนุมัติค่าตอบแทนกรรมการ", "อนุมัติธุรกรรมทั่วไปของบริษัท"
        ],
        specialAgendas: [
            "แก้ไขหนังสือบริคณห์สนธิ", "แก้ไขข้อบังคับบริษัท", "เพิ่มทุนจดทะเบียน",
            "ลดทุน", "เปลี่ยนชื่อบริษัท", "ควบรวมบริษัท", "เลิกบริษัท",
            "แปลงสภาพบริษัท", "ออกหุ้นบุริมสิทธิ"
        ]
    }
];